{
    "architectures": [
      "QWenLMHeadModel"
    ],
    "auto_map": {
      "AutoConfig": "configuration_qwen.QWenConfig",
      "AutoModelForCausalLM": "modeling_qwen.QWenLMHeadModel"
    },
    "attn_dropout_prob": 0.0,
    "bf16": true,
    "fp16": false,
    "fp32": false,
    "emb_dropout_prob": 0.0,
    "intermediate_size": 22016,
    "initializer_range": 0.02,
    "kv_channels": 128,
    "layer_norm_epsilon": 1e-06,
    "model_type": "qwen",
    "hidden_size": 4096,
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "max_position_embeddings": 2048,
    "no_bias": true,
    "onnx_safe": null,
    "rotary_emb_base": 10000,
    "rotary_pct": 1.0,
    "scale_attn_weights": true,
    "seq_length": 2048,
    "softmax_in_fp32": false,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "tokenizer_type": "QWenTokenizer",
    "transformers_version": "4.36.2",
    "use_cache": true,
    "vocab_size": 155947,
    "use_dynamic_ntk": true,
    "use_logn_attn": true,
    "use_flash_attn":"auto",
    "use_cache_kernel":false,
    "use_cache_quantization":false,
    "audio": {
        "n_mels":80,
        "n_ctx": 1500,
        "n_state": 1280,
        "n_head": 20,
        "n_layer": 32,
        "output_dim": 4096,
        "avg_pool": true,
        "add_audio_bos_eos_token": true,
        "audio_start_id": 155163
    }
  }

  